In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv("C:\\Users\\Shree com\\Desktop\\Data\\titanic.csv",usecols = ['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  34.5   7.8292
1         1  47.0   7.0000
2         0  62.0   9.6875
3         0  27.0   8.6625
4         1  22.0  12.2875

In [3]:
import matplotlib.pyplot as plt 
from sklearn.model_selection import train_test_split

In [4]:
df.isnull().sum()

Survived     0
Age         86
Fare         1
dtype: int64

In [5]:
df['Age'].fillna(df['Age'].mean() , inplace = True)
df['Fare'].fillna(df['Fare'].mean() , inplace = True)

In [6]:
df.isnull().sum()

Survived    0
Age         0
Fare        0
dtype: int64

In [7]:
x = df.iloc[: , 1:] 
y = df.iloc[:,0]

In [8]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size = 0.2)

In [9]:
x_train.head(2)

      Age     Fare
142  61.0  262.375
31   24.0   31.500

In [10]:
from sklearn.compose import ColumnTransformer 
from sklearn.preprocessing import KBinsDiscretizer

In [11]:
kbin_Age = KBinsDiscretizer(n_bins = 15 , encode = 'ordinal' , strategy = 'quantile') 
kbin_Age

KBinsDiscretizer(encode='ordinal', n_bins=15)

In [12]:
kbin_Fare = KBinsDiscretizer(n_bins = 15 , encode = 'ordinal', strategy = 'quantile') 
kbin_Fare

KBinsDiscretizer(encode='ordinal', n_bins=15)

In [13]:
trf = ColumnTransformer([
    ('first' , kbin_Age , [0]),
    ('second' , kbin_Fare , [1])
])

In [14]:
trf

ColumnTransformer(transformers=[('first',
                                 KBinsDiscretizer(encode='ordinal', n_bins=15),
                                 [0]),
                                ('second',
                                 KBinsDiscretizer(encode='ordinal', n_bins=15),
                                 [1])])

In [15]:
x_train_trf = trf.fit_transform(x_train) 
x_test_trf = trf.transform(x_test)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\preprocessing\_discretization.py:230: UserWarning: Bins whose width are too small (i.e., <= 1e-8) in feature 0 are removed. Consider decreasing the number of bins.
  warnings.warn(

In [16]:
# x_train_trf

In [17]:
trf.named_transformers_['first'].bin_edges_

array([array([ 0.17      , 13.        , 18.        , 21.        , 23.        ,
              25.        , 27.        , 30.        , 30.27259036, 33.        ,
              39.        , 45.        , 53.8       , 67.        ])            ],
      dtype=object)

In [18]:
output = pd.DataFrame({
    'Age' : x_train['Age'] , 
    'Age_trf': x_train_trf[:,0],
    'Fare' : x_train['Fare'],
    'Fare_trf' : x_train_trf[: , 1]
})

In [19]:
output

          Age  Age_trf      Fare  Fare_trf
142  61.00000     12.0  262.3750      14.0
31   24.00000      4.0   31.5000      11.0
114  63.00000     12.0  221.7792      14.0
282  30.27259      8.0    7.7500       2.0
176  20.00000      2.0   36.7500      11.0
..        ...      ...       ...       ...
191  30.27259      8.0   26.0000      10.0
41   30.27259      8.0   26.5500      10.0
417  30.27259      8.0   22.3583       9.0
221  21.00000      3.0    8.0500       4.0
416  30.27259      8.0    8.0500       4.0

[334 rows x 4 columns]

In [20]:
output['Age_labels'] = pd.cut(x = x_train['Age'] , 
                              bins = trf.named_transformers_['first'].bin_edges_[0].tolist())


output['Fare_labels'] = pd.cut(x = x_train['Fare'] , 
                              bins = trf.named_transformers_['second'].bin_edges_[0].tolist())

In [21]:
output

          Age  Age_trf      Fare  Fare_trf      Age_labels        Fare_labels
142  61.00000     12.0  262.3750      14.0    (53.8, 67.0]  (129.38, 512.329]
31   24.00000      4.0   31.5000      11.0    (23.0, 25.0]     (28.6, 39.635]
114  63.00000     12.0  221.7792      14.0    (53.8, 67.0]  (129.38, 512.329]
282  30.27259      8.0    7.7500       2.0  (30.0, 30.273]      (7.229, 7.75]
176  20.00000      2.0   36.7500      11.0    (18.0, 21.0]     (28.6, 39.635]
..        ...      ...       ...       ...             ...                ...
191  30.27259      8.0   26.0000      10.0  (30.0, 30.273]       (21.0, 26.0]
41   30.27259      8.0   26.5500      10.0  (30.0, 30.273]       (26.0, 28.6]
417  30.27259      8.0   22.3583       9.0  (30.0, 30.273]       (21.0, 26.0]
221  21.00000      3.0    8.0500       4.0    (18.0, 21.0]     (7.896, 8.113]
416  30.27259      8.0    8.0500       4.0  (30.0, 30.273]     (7.896, 8.113]

[334 rows x 6 columns]

In [22]:
x_train

          Age      Fare
142  61.00000  262.3750
31   24.00000   31.5000
114  63.00000  221.7792
282  30.27259    7.7500
176  20.00000   36.7500
..        ...       ...
191  30.27259   26.0000
41   30.27259   26.5500
417  30.27259   22.3583
221  21.00000    8.0500
416  30.27259    8.0500

[334 rows x 2 columns]